Repository: sslavik/acdat
Catalog: TMXParser/en-es.tmx
Source language: en
Languages: es

source: If not, display the code / / instead. if (trustedFile($parser_file[$parser])) {eval($data);} else {printf("Untrusted PHP code: i %s / i ", htmlspecialchars($data));} break;}} function defaultHandler($parser, $data) {if (substr($data, 0, 1) ==" "substr($data, -1, 1) ==" ;") {printf( 'font color="#aa00aa "%s / font', htmlspecialchars($data));} else {printf( 'font size="-1" %s / font', htmlspecialchars($data));}} function externalEntityRefHandler($parser, $openEntityNames, $base, $systemId, $publicId) {if ($systemId) {if (!list($parser, $fp) = new_xml_parser($systemId)) {printf("Could not open entity %s at %s\n", $openEntityNames, $systemId); return false;} while ($data = fread($fp, 4096)) {if (!xml_parse($parser, $data, feof($fp))) {printf("XML error: %s at line %d while parsing entity %s\n", xml_error_string(xml_get_error_code($parser)), xml_get_current_line_number($parser), $openEntityNames); xml_parser_free($parser); return false;}} xml_parser_free($parser); return true;} return false;} function new_xml_parser($file) {global $parser_file; $xml_parser = xml_parser_create(); xml_parser_set_option($xml_parser, XML_OPTION_CASE_FOLDING, 1); xml_set_element_handler($xml_parser, "startElement", "endElement"); xml_set_character_data_handler($xml_parser, "characterData"); xml_set_processing_instruction_handler($xml_parser, "PIHandler"); xml_set_default_handler($xml_parser, "defaultHandler"); xml_set_external_entity_ref_handler($xml_parser, "externalEntityRefHandler"); if (!($fp = @fopen($file, "r"))) {return false;} if (!is_array($parser_file)) {settype($parser_file, "array");} $parser_file[$xml_parser] = $file; return array($xml_parser, $fp);} if (!(list($xml_parser, $fp) = new_xml_parser($file))) {die("could not open XML input");} print "pre"; while ($data = fread($fp, 4096)) {if (!xml_parse($xml_parser, $data, feof($fp))) {die(sprintf("XML error: %s at line %d\n", xml_error_string(xml_get_error_code($xml_parser)), xml_get_current_line_number($xml_parser)));}} print "/ pre"; print "parse complete\n"; xml_parser_free($xml_parser);?
es: $file = "xmltest.xml"; function trustedFile($file) {/ / solamente confía en archivos locales que nos pertenezcan if (!eregi("^([a-z]+): / /", $file) fileowner($file) == getmyuid()) {return true;} return false;} function startElement($parser, $name, $attribs) {print" lt; font color=\"#0000cc\ "$name / font"; if (sizeof($attribs)) {while (list($k, $v) = each($attribs)) {print "font color=\"#009900\" $k / font =\ "font color=\"#990000\" $v / font \"";}} print "gt ;";} function endElement($parser, $name) {print" lt; / font color=\"#0000cc\ "$name / font gt ;";} function characterData($parser, $data) {print" b $data / b ";} function PIHandler($parser, $target, $data) {switch (strtolower($target)) {case "php": global $parser_file; / / Si el documento analizado es "de confianza", diremos / / que es seguro ejecutar código PHP en su interior. / / Si no, en vez de ello mostrará el código. if (trustedFile($parser_file[$parser])) {eval($data);} else {printf("Untrusted PHP code: i %s / i", htmlspecialchars($data));} break;}} function defaultHandler($parser, $data) {if (substr($data, 0, 1) == "" substr($data, -1, 1) == ";") {printf( 'font color="#aa00aa" %s / font', htmlspecialchars($data));} else {printf( 'font size="-1 "%s / font', htmlspecialchars($data));}} function externalEntityRefHandler($parser, $openEntityNames, $base, $systemId, $publicId) {if ($systemId) {if (!list($parser, $fp) = new_xml_parser($systemId)) {printf("Could not open entity %s at %s\n", $openEntityNames, $systemId); return false;} while ($data = fread($fp, 4096)) {if (!xml_parse($parser, $data, feof($fp))) {printf("XML error: %s at line %d while parsing entity %s\n", xml_error_string(xml_get_error_code($parser)), xml_get_current_line_number($parser), $openEntityNames); xml_parser_free($parser); return false;}} xml_parser_free($parser); return true;} return false;} function new_xml_parser($file) {global $parser_file; $xml_parser = xml_parser_create(); xml_parser_set_option($xml_parser, XML_OPTION_CASE_FOLDING, 1); xml_set_element_handler($xml_parser, "startElement", "endElement"); xml_set_character_data_handler($xml_parser, "characterData"); xml_set_processing_instruction_handler($xml_parser, "PIHandler"); xml_set_default_handler($xml_parser, "defaultHandler"); xml_set_external_entity_ref_handler($xml_parser, "externalEntityRefHandler"); if (!($fp = @fopen($file, "r"))) {return false;} if (!is_array($parser_file)) {settype($parser_file, "array");} $parser_file[$xml_parser] = $file; return array($xml_parser, $fp);} if (!(list($xml_parser, $fp) = new_xml_parser($file))) {die("could not open XML input");} print" pre "; while ($data = fread($fp, 4096)) {if (!xml_parse($xml_parser, $data, feof($fp))) {die(sprintf("XML error: %s at line %d\n", xml_error_string(xml_get_error_code($xml_parser)), xml_get_current_line_number($xml_parser)));}} print" / pre "; print "parse complete\n"; xml_parser_free($xml_parser);?

source: Example 4. xmltest.xml
es: Ejemplo 4. xmltest.xml

source: ?xml version=' 1.0'? !DOCTYPE chapter SYSTEM "/ just / a/test.dtd" [!ENTITY plainEntity "FOO entity "!ENTITY systemEntity SYSTEM "xmltest2.xml"] chapter TITLE Title plainEntity; / TITLE para informaltable tgroup cols="3 "tbody row entry a1 / entry entry morerows="1" b1 / entry entry c1 / entry / row row entry a2 / entry entry c2 / entry / row row entry a3 / entry entry b3 / entry entry c3 / entry / row / tbody / tgroup / informaltable / para systemEntity; section id="about "title About this Document / title para !- - this is a comment - - ?php print'Hi!
es: ?xml version=' 1.0'? !DOCTYPE chapter SYSTEM "/ just / a/test.dtd" [!ENTITY plainEntity "FOO entity "!ENTITY systemEntity SYSTEM "xmltest2.xml"] chapter TITLE Title plainEntity; / TITLE para informaltable tgroup cols="3 "tbody row entry a1 / entry entry morerows="1" b1 / entry entry c1 / entry / row row entry a2 / entry entry c2 / entry / row row entry a3 / entry entry b3 / entry entry c3 / entry / row / tbody / tgroup / informaltable / para systemEntity; sect1 id="about "title About this Document / title para !- - this is a comment - - ?php print 'Hi!

source: This is PHP version '.phpversion();? / para / section / chapter
es: This is PHP version '.phpversion();? / para / sect1 / chapter

source: This file is included from xmltest.xml:
es: Este archivo se incluye desde xmltest.xml:

source: Example 5. xmltest2.xml
es: Ejemplo 5. xmltest2.xml

source: This PHP extension provides a processor independent API to XSLT transformations.
es: Aviso

source: Support is planned for other libraries, such as the Xalan library or the libxslt library.
es: Este módulo es EXPERIMENTAL.

source: It is a standard defined by The World Wide Web Consortium (W3C).
es: Esto significa que el comportamineto de estas funciones, nombre de funciones y en definitiva TODO lo documentado aqui, puede cambiar en una futura version de PHP SIN AVISO.

source: Binaries are provided as well as source.
es: It is a standard defined by The World Wide Web consortium (W3C).

source: The configuration options: --with-expat-dir=DIR --with-iconv-dir=DIR are there to help you specify them.
es: This extension uses Sabloton and expat, which can both be found at http: / /www.gingerall.com /.

source: If you compiled Sablotron with JavaScript support, you must specify the option: --with-sablot-js=DIR.
es: On UNIX, run configure with the --with-sablot and --enable-sablot-errors-descriptive options.

source: Drop all logging and error reporting.
es: This toolkit lets you transform XML documents into other documents, including new XML documents, but also into HTML or other target formats.

source: Consider unresolved documents (the document() function) non-lethal.
es: It basically provides a standardized and portable template mechanism, separating content and design of a website.

source: This extension offers a PHP interface to the YAZ toolkit that implements the Z39.50 Protocol for Information Retrieval.
es: The yaz() functions wrap the YAZ API.

source: With this extension you can easily implement a Z39.50 origin (client) that searches or scans Z39.50 targets (servers) in parallel.
es: The home page of the project is http: / /www.indexdata.dk / yaz /.

source: It supports persistent stateless connections very similar to those offered by the various RDB APIs that are available for PHP.
es: Information about the phpyaz module can be found at http: / /www.indexdata.dk / phpyaz /.

source: YAZ is available at http: / /www.indexdata.dk / yaz /.
es: PHP / YAZ is much simpler to use than the C API for YAZ but less flexible.

source: Compile YAZ (ANSI / NISO Z39.50 support) and install it.
es: The intent is to make it easy to build basic client functions.

source: Your task is roughly the following:
es: It supports persistent stateless connections very similar to those offered by the various SQL APIs that are available for PHP.

source: A resource represents a connection to a target.
es: When invoked it either prints a query form (if no arguments are supplied) or if there are arguments (term and one or more hosts) it searches the targets in array host.

source: Parallel searching using YAZ()
es: Ejemplo 1.

source: The script below demonstrates the parallel searching feature of the API.
es: YAZ()

source: $num_hosts = count ($host); if (empty($term) _BAR_ _BAR_ count($host) == 0) {echo 'form method="get "input type="checkbox" name="host[] "value="bagel.indexdata.dk / gils" GILS test input type="checkbox "name="host[]" value="localhost:9999 / Default "local test input type="checkbox" checked="1 "name="host[]" value="z3950.loc.gov:7090 / voyager "Library of Congress br RPN Query: input type="text" size="30 "name="term" input type="submit "name="action" value="Search "';} else {echo'You searced for '. htmlspecialchars($term).' br '; for ($i = 0; $i $num_hosts; $i++) {$id[] = yaz_connect($host[$i]); yaz_range($id[$i], 1, 10); yaz_search($id[$i] ,"rpn",$term);} yaz_wait(); for ($i = 0; $i $num_hosts; $i++) {echo' hr '. $host[$i]." :"; $error = yaz_error($id[$i]); if (!empty($error)) {echo "Error: $error";} else {$hits = yaz_hits($id[$i]); echo "Result Count $hits";} echo' dl '; for ($p = 1; $p = 10; $p++) {$rec = yaz_record($id[$i],$p ,"string"); if (empty($rec)) continue; echo "dt b $p / b / dt dd"; echo ereg_replace("\n", "br \n",$rec); echo" / dd ";} echo' / dl ';}}
es: $num_hosts = count ($host); if (empty($term) _BAR_ _BAR_ count($host) == 0) {echo 'form method="get "input type="checkbox" name="host[] "value="bagel.indexdata.dk / gils" GILS test input type="checkbox "name="host[]" value="localhost:9999 / Default "local test input type="checkbox" checked="1 "name="host[]" value="z3950.bell-labs.com / books "BELL Labs Library br RPN Query: input type="text" size="30 "name="term" input type="submit "name="action" value="Search "';} else {echo 'You searced for '. htmlspecialchars($term).' br '; for ($i = 0; $i $num_hosts; $i++) {$id[] = yaz_connect($host[$i]); yaz_syntax($id[$i] ,"sutrs"); yaz_search($id[$i] ,"rpn",$term);} yaz_wait(); for ($i = 0; $i $num_hosts; $i++) {echo' hr '. $host[$i]." :"; $error = yaz_error($id[$i]); if (!empty($error)) {echo "Error: $error";} else {$hits = yaz_hits($id[$i]); echo "Result Count $hits";} echo' dl '; for ($p = 1; $p = 10; $p++) {$rec = yaz_record($id[$i],$p ,"string"); if (empty($rec)) continue; echo "dt b $p / b / dt dd"; echo ereg_replace("\n", "br \n",$rec); echo" / dd ";} echo' / dl ';}}

source: This feature requires a C runtime library that provides the fopencookie() This feature requires a C runtime library that provides the fopencookie() function.
es: Este módulo usa la función de zlib de Jean-loup Gailly y Mark Adler para leer y grabar archivos comprimidos .gz, de un modo transparente.

source: The zlib extension offers the option to transparently compress your pages on-the-fly, if the requesting browser supports this.
es: Con este módulo, es requisito usar una versión de zlib igual o posterior a 1.0.9.

source: If you output a "Content-Type: image /" header the compression is disabled, too (in order to circumvent a Netscape bug).
es: Este módulo contiene versiones de la mayoría de las funciones de Sistema de archivos que funcionan con los archivos comprimidos con gzip (y con los no-comprimidos tambien, pero no con conectores (sockets)).

source: This option also accepts integer values instead of boolean "On" / "Off", using this you can set the output buffer size (default is 4KB).
es: Abre un archivo temporal y escribe en él, una cadena de prueba, y luego presenta el cotenido del archivo dos veces

source: This setting does the same as output_handler but in a different order.
es: Ejemplo 1.

source: This example opens a temporary file and writes a test string to it, then it prints out the content of this file twice.
es: Ejemplo de Zlib

source: ?php $filename = tempnam ('/ tmp', 'zlibtest') .'.gz'; print "html \n head / head \n body \n pre \n"; $s = "Only a test, test, test, test, test, test, test, test!\n"; / / open file for writing with maximum compression $zp = gzopen($filename, "w9"); / / write string to file gzwrite($zp, $s); / / close file gzclose($zp); / / open file for reading $zp = gzopen($filename, "r"); / / read 3 char print gzread($zp, 3); / / output until end of the file and close it. gzpassthru($zp); print "\n"; / / open file and print content (the 2nd time). if (readgzfile($filename) != strlen($s)) {echo "Error with zlib functions !";} unlink($filename); print" / pre \n / h1 / body \n / html \n";?
es: ?php $filename = tempnam( '/ tmp', 'zlibtest') .'.gz'; print "html \n head / head \n body \n pre \n"; $s = "Sólo es una prueba, prueba, prueba,prueba, prueba, prueba!\n"; / / Abre el archivo para escribirlo con máximo de compresión $zp = gzopen($filename, "w9"); / / Escribe la cadena en él gzwrite($zp, $s); / / Cierra el fichero gzclose($zp); / / Abre el fichero para lectura $zp = gzopen($filename, "r"); / / Lee 3 caracteres print gzread($zp, 3); / / Salida hasta el final del fichero, para cerrarlo luego. gzpassthru($zp); print "\n"; / / Abre el fichero y muestra su contenido (por segunda vez). if (readgzfile($filename) != strlen($s)) {echo "Error con las funciones zlib !";} unlink($filename); print" pre \n / h1 / body \n / html \n";?

source: Appendix G.
es: Apéndice G.

source: Predefined Constants
es: Constantes predefinidas

source: These constants are defined by the PHP core.
es: Core Predefined Constants - - Constants defined in the PHP core, Zend, and SAPI modules

source: Table G-1.
es: Tabla G-1.

source: Table H-1.
es: Tabla H-1.

source: Chapter 5.
es: Capítulo 5.

source: Security
es: Seguridad

source: You can protect against this with Apache authorization, or you can design your own access model using LDAP, .htaccess files, etc. and include that code as part of your PHP scripts.
es: Cuando PHP es usado como modulo Apache, hereda los permisos de usuario de Apache (normalmente "nobody")

source: Installed as CGI binary
es: Seguridad

source: Filesystem Security
es: Referencia del Lenguaje

source: PHP is a powerful language and the interpreter, whether included in a web server as a module or executed as a separate CGI binary, is able to access files, execute commands and open network connections on the server.
es: Todas estas caracteristicas hacen que lo que se ejecute en el servidor web sea inseguro por defecto.

source: These properties make anything run on a web server insecure by default.
es: Ya que existen diferentes modos de utilizar PHP, existen multitud de opciones de configuración que permiten controlar su funcionamiento.

source: PHP is designed specifically to be a more secure language for writing CGI programs than Perl or C, and with correct selection of compile-time and runtime configuration options, and proper coding practices, it can give you exactly the combination of freedom and security you need.
es: Este capitulo explica las diferentes combinaciones de opciones de configuración y las situaciones donde pueden ser usadas de manera segura.

source: As there are many different ways of utilizing PHP, there are many configuration options controlling its behaviour.
es: Apache), o usaran PHP con diferentes clases de CGI wrappers para crear entornos chroot y setuid seguros para los scripts.

source: A large selection of options guarantees you can use PHP for a lot of purposes, but it also means there are combinations of these options and server configurations that result in an insecure setup.
es: El documento del CERT CA-96.11 recomienda no instalar interpretes en cgi-bin.

source: The configuration flexibility of PHP is equally rivalled by the code flexibility.
es: Accediendo a ficheros del sistema: http: / /my.host / cgi-bin / php? / etc / passwd

source: PHP can be used to build complete server applications, with all the power of a shell user, or it can be used for simple server-side includes with little risk in a tightly controlled environment.
es: Normalmente los interpretes abren y ejecutan el fichero especificado como el primer argumento en la línea de comando.

source: How you build that environment, and how secure it is, is largely up to the PHP developer.
es: Accediendo cualquier documento web en el servidor: http: / /my.host / cgi-bin / php / secret / doc.html

source: This chapter starts with some general security advice, explains the different configuration option combinations and the situations they can be safely used, and describes different considerations in coding for different levels of security.
es: Con esta configuración, el servidor web comprueba primero los permisos de acceso al directorio / secret, y despues crea la petición redireccionada http: / /my.host / cgi-bin / php / secret / script.php3.

source: A completely secure system is a virtual impossibility, so an approach often used in the security profession is one of balancing risk and usability.
es: De esta manera cualquier usuario que pueda acceder / cgi-bin / php tambien puede acceder a cualquier documento protegido en el servidor web.

source: If every variable submitted by a user required two forms of biometric validation (such as a retinal scan and a fingerprint), you would have an extremely high level of accountability.
es: Si tu servidor no contiene informacion que este protegida con clave o acceso de control de IPs, no se necesitan estas opciones de configuracion.

source: It would also take half an hour to fill out a fairly complex form, which would tend to encourage users to find ways of bypassing the security.
es: Esta opcion a la hora de compilar previene que alguien llame PHP directamente con una url como la siguiente http: / /my.host / cgi-bin / php / secretdir / script.php3.

source: The best security is often inobtrusive enough to suit the requirements without the user being prevented from accomplishing their work, or over-burdening the code author with excessive complexity.
es: Normalmente la redireccion en la configuracion de Apache es hecha con la siguientes directivas:

source: Indeed, some security attacks are merely exploits of this kind of overly built security, which tends to erode over time.
es: Esta opcion ha sido solo comprobada con el servidor web Apache, y depende de Apache para fijar la variable de entorno CGI no estandar REDIRECT_STATUS en las peticiones de redireccionamiento.

source: A phrase worth remembering:
es: Incluir contenidos activos, como script y ejecutables, en el directorio de documentos del servidor web, es algunas veces considerada una practica insegura.

source: A system is only as good as the weakest link in a chain.
es: Por ello, muchos administradores prefieren utilizar otra estructura de directorios que contenga solamente los scripts, los cuales seran solamente accesibles via PHP CGI, y por ello siempre seran interpretados y no mostrados.

source: If all transactions are heavily logged based on time, location, transaction type, etc. but the user is only verified based on a single cookie, the validity of tying the users to the transaction log is severely weakened.
es: Podeis definir el script PHP "document root" con la directiva de configuracion doc_root en el fichero de configuracion, o definir la variable de entorno PHP_DOCUMENT_ROOT.

source: When testing, keep in mind that you will not be able to test all possibilities for even the simplest of pages.
es: Otra opcion que se puede usar aqui es user_dir.

source: The input you may expect will be completely unrelated to the input given by a disgruntled employee, a cracker with months of time on their hands, or a housecat walking across the keyboard.
es: Si intentamos abrir una url tal como esta http: / /my.host / ~user / doc.php3 no se abrira un fichero en el directorio de usuarios, en su lugar se abrira un fichero llamado ~user / doc.php3 en el directorio doc_root. (si, un directorio que empieza por tilde [~]).

source: This is why it 's best to look at the code from a logical perspective, to discern where unexpected data can be introduced, and then follow how it is modified, reduced, or amplified.
es: Si el directorio del usuario es / home / user, el fichero ejecutado sera / home / user / public_php / doc.php3.

source: The Internet is filled with people trying to make a name for themselves by breaking your code, crashing your site, posting inappropriate content, and otherwise making your day interesting.
es: Una opcion muy segura es poner el analizador binario PHP, en algun lugar fuera del arbol de ficheros web.

source: It doesn 't matter if you have a small or large site, you are a target by simply being online, by having a server that can be connected to.
es: La unica pega real de esta opcion es que habra que poner una linea similar a:

source: Try not to become one.
es: Para conseguir que PHP maneje correctamente con esta configuracion, la informacion de PATH_INFO y PATH_TRANSLATED, el analizador PHP deberia ser compilado con la opcion de configuracion --enable-discard-path.

source: Configuration directives
es: Configuración

source: Chapter 43.
es: Capítulo 43.

source: Example 43-1. simple stream example that displays the PHP home page
es: Ejemplo 43-1. simple stream example that displays the PHP home page

source: Table 43-1.
es: Tabla 43-1.

source: One or more of these values can be combined using the OR operator.
es: Stream open options - - Affects the operation of stream factory functions

source: Frequently Asked Questions
es: Preguntas frecuentes

source: Table 43-2.
es: Tabla 43-2.

source: Table 43-1. php_stream_make_seekable() return values
es: Tabla 43-1. php_stream_make_seekable() return values

source: Example 43-2.
es: Ejemplo 43-2.

source: Example 43-3.
es: Ejemplo 43-3.

source: php_stream_dirent char d_name[ MAXPATHLEN]
es: struct php_stream_dirent - - Holds information about a single file during dir scanning

source: php_stream_statbuf struct stat sb
es: struct php_stream_statbuf - - Holds information about a file or URL

source: Various parts of the PHP language are represented internally by types like T_SR.
es: Varias partes del lenguaje PHP están representadas internamente por cosas tales como T_SR.

source: PHP outputs identifiers like this one in parse errors, like "Parse error: unexpected T_SR, expecting ',' or ';' in script.php on line 10."
es: T_SR inesperado, se esperaba ',' o ';' en la línea 10 de script.php .").

source: You 're supposed to know what T_SR means.
es: Supongamos que tú sabes que T_SR significa.

source: For everybody who doesn 't know that, here is a table with those identifiers, PHP-syntax and references to the appropriate places in the manual.
es: Para quienes no lo conocen, aquí hay una tabla con esos identificadores, la sintaxis de PHP, y referencias a lugares apropiados del manual.

source: Table J-1.
es: Tabla J-1.

source: Tokens
es: Identificadores (Tokens)
